# 二維列表、巢狀迴圈

nums = [
    [0,1,2],
    [3,4,5],
    [6,7,8],
    [9]
]
print(nums)
# 四行三列列表
# -->
# [[0, 1, 2], [3, 4, 5], [6, 7, 8], [9]]

# 由二維列表中 取值--二維列表名稱[行][列]
# print(nums[0][0])-->0
# print(nums[3][0])-->9

# 巢狀迴圈，迴圈中又有迴圈
# row:行，col:列
# 欲印出二維列表中所有值
for row in nums:
    for col in row: #先把 列表中每個值 放進 列（相當於把每一行放到row裡面）
        print(col) #再把每一列放進行（把每一行的值 拆成 每一列）
# -->
# 0
# 1
# 2
# 3
# 4
# 5
# 6
# 7
# 8
# 9

#三維列表 及 取值
nums = [
    [[0,1,2]],
    [3,4,5],
    [6,7,8],
    [9]
]
nums[0][0][0]
